// Частина №1

// Створити скрипт яки повинен виконувати наступне:
// запитати у користувача рік народження;
// запитати в нього, в якому місті він живе;
// запитати його улюблений вид спорту.

// При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
// його вік;
// якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.

// Частина №2

// Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.

// Все це має бути відображено в одному вікні (алерті).

// Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .

let userYearOfBirth = +prompt('Вкажіть Ваш рік народження');
let userCity = prompt('В якому місті Ви живете?');
let userSport = prompt('Який Ваш улюблений вид спорту?');

// when user do not want to say "year of birth"
if (userYearOfBirth === null || userYearOfBirth === 0) {
    // options with cities
    // "Київ"
    if (userCity === 'Київ' && userSport === 'Теніс') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці України
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (((userCity !== 'Київ' && userCity !== 'Вашингтон' && userCity !== 'Лондон') && (userCity !== null && userCity !== '' && userCity !== ' ')) && userSport === 'Теніс') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (userCity === 'Київ' && userSport === 'Футбол') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці України
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (((userCity !== 'Київ' && userCity !== 'Вашингтон' && userCity !== 'Лондон') && (userCity !== null && userCity !== '' && userCity !== ' ')) && userSport === 'Футбол') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (userCity === 'Київ' && userSport === 'Бокс') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці України
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (((userCity !== 'Київ' && userCity !== 'Вашингтон' && userCity !== 'Лондон') && (userCity !== null && userCity !== '' && userCity !== ' ')) && userSport === 'Бокс') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (userCity === 'Київ' && ((userSport !== 'Теніс' && userSport !== 'Футбол' && userSport !== 'Бокс') && (userSport !== null && userSport !== '' && userSport !== ' '))) {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці України
            Ваш улюблений спорт ${userSport}
        `);
    }
    // "Вашингтон"
    else if (userCity === 'Вашингтон' && userSport === 'Теніс') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці Сполучених Штатів Америки
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (userCity === 'Вашингтон' && userSport === 'Футбол') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці Сполучених Штатів Америки
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (userCity === 'Вашингтон' && userSport === 'Бокс') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці Сполучених Штатів Америки
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (userCity === 'Вашингтон' && ((userSport !== 'Теніс' && userSport !== 'Футбол' && userSport !== 'Бокс') && (userSport !== null && userSport !== '' && userSport !== ' '))) {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці Сполучених Штатів Америки
            Ваш улюблений спорт ${userSport}
        `);
    }
    // "Лондон"
    else if (userCity === 'Лондон' && userSport === 'Теніс') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці Англії
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (userCity === 'Лондон' && userSport === 'Футбол') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці Англії
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (userCity === 'Лондон' && userSport === 'Бокс') {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці Англії
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (userCity === 'Лондон' && ((userSport !== 'Теніс' && userSport !== 'Футбол' && userSport !== 'Бокс') && (userSport !== null && userSport !== '' && userSport !== ' '))) {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у столиці Англії
            Ваш улюблений спорт ${userSport}
        `);
    }
    else if (userCity === null || userCity === '' || userCity === ' ') {
        if (userSport === 'Теніс') {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Шкода, що Ви не захотіли ввести своє місто
                Круто! Хочеш стати Еліною Світоліною?
            `);
        }
        else if (userSport === 'Футбол') {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Шкода, що Ви не захотіли ввести своє місто
                Круто! Хочеш стати Андрієм Шевченко?
            `);
        }
        else if (userSport === 'Бокс') {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Шкода, що Ви не захотіли ввести своє місто
                Круто! Хочеш стати Олександром Усиком?
            `);
        }
        else if (userSport === null || userSport === '' || userSport === ' ') {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Шкода, що Ви не захотіли ввести своє місто
                Шкода, що Ви не захотіли ввести свій спорт
            `);
        }
        else {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Шкода, що Ви не захотіли ввести своє місто
                Ваш улюблений спорт ${userSport}
            `);
        }
    }
    // sport
    else if (userSport === 'Теніс' && ((userCity !== 'Київ') && (userCity !== 'Вашингтон') && (userCity !== 'Лондон'))) {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (userSport === 'Футбол' && ((userCity !== 'Київ') && (userCity !== 'Вашингтон') && (userCity !== 'Лондон'))) {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (userSport === 'Бокс' && ((userCity !== 'Київ') && (userCity !== 'Вашингтон') && (userCity !== 'Лондон'))) {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (userSport === null || userSport === '' || userSport === ' ') {
        if (userCity === 'Київ') {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Ти живеш у столиці України
                Шкода, що Ви не захотіли ввести свій спорт
            `);
        }
        else if (userCity === 'Вашингтон') {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Ти живеш у столиці Сполучених Штатів Америки
                Шкода, що Ви не захотіли ввести свій спорт
            `);
        }
        else if (userCity === 'Лондон') {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Ти живеш у столиці Англії
                Шкода, що Ви не захотіли ввести свій спорт
            `);
        }
        else {
            alert(`
                Шкода, що Ви не захотіли ввести свій рік народження
                Ти живеш у місті ${userCity}
                Шкода, що Ви не захотіли ввести свій спорт
            `);
        }
    }
    // rest
    else {
        alert(`
            Шкода, що Ви не захотіли ввести свій рік народження
            Ти живеш у місті ${userCity}
            Ваш улюблений спорт ${userSport}
        `);
    }
}
// when user do not want to say "city"
else if (userCity === null || userCity === '' || userCity === ' ') {
    if (userSport === 'Теніс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Шкода, що Ви не захотіли ввести своє місто
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (userSport === 'Футбол') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Шкода, що Ви не захотіли ввести своє місто
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (userSport === 'Бокс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Шкода, що Ви не захотіли ввести своє місто
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (userSport === null || userSport === '' || userSport === ' ') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Шкода, що Ви не захотіли ввести своє місто
            Шкода, що Ви не захотіли ввести свій спорт
        `);
    }
    else {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Шкода, що Ви не захотіли ввести своє місто
            Ваш улюблений спорт ${userSport}
        `);
    }
}
// when user do not want to say "sport"
else if (userSport === null || userSport === '' || userSport === ' ') {
    if (userCity === 'Київ') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці України
            Шкода, що Ви не захотіли ввести свій спорт
        `);
    }
    else if (userCity === 'Вашингтон') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Сполучених Штатів Америки
            Шкода, що Ви не захотіли ввести свій спорт
        `);
    }
    else if (userCity === 'Лондон') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Англії
            Шкода, що Ви не захотіли ввести свій спорт
        `);
    }
    else {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у місті ${userCity}
            Шкода, що Ви не захотіли ввести свій спорт
        `);
    }
}
// rest
else {
    // options with "Київ"
    if (userCity === 'Київ' && userSport === 'Теніс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці України
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if ((userCity !== 'Київ' && userCity !== 'Вашингтон' && userCity !== 'Лондон') && userSport === 'Теніс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (userCity === 'Київ' && userSport === 'Футбол') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці України
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if ((userCity !== 'Київ' && userCity !== 'Вашингтон' && userCity !== 'Лондон') && userSport === 'Футбол') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (userCity === 'Київ' && userSport === 'Бокс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці України
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if ((userCity !== 'Київ' && userCity !== 'Вашингтон' && userCity !== 'Лондон') && userSport === 'Бокс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у місті ${userCity}
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (userCity === 'Київ' && (userSport !== 'Теніс' && userSport !== 'Футбол' && userSport !== 'Бокс')) {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці України
            Ваш улюблений спорт ${userSport}
        `);
    }
    // options with "Вашингтон"
    else if (userCity === 'Вашингтон' && userSport === 'Теніс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Сполучених Штатів Америки
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (userCity === 'Вашингтон' && userSport === 'Футбол') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Сполучених Штатів Америки
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (userCity === 'Вашингтон' && userSport === 'Бокс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Сполучених Штатів Америки
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (userCity === 'Вашингтон' && (userSport !== 'Теніс' && userSport !== 'Футбол' && userSport !== 'Бокс')) {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Сполучених Штатів Америки
            Ваш улюблений спорт ${userSport}
        `);
    }
    // options with "Лондон"
    else if (userCity === 'Лондон' && userSport === 'Теніс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Англії
            Круто! Хочеш стати Еліною Світоліною?
        `);
    }
    else if (userCity === 'Лондон' && userSport === 'Футбол') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Англії
            Круто! Хочеш стати Андрієм Шевченко?
        `);
    }
    else if (userCity === 'Лондон' && userSport === 'Бокс') {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Англії
            Круто! Хочеш стати Олександром Усиком?
        `);
    }
    else if (userCity === 'Лондон' && (userSport !== 'Теніс' && userSport !== 'Футбол' && userSport !== 'Бокс')) {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у столиці Англії
            Ваш улюблений спорт ${userSport}
        `);
    }
    // rest
    else {
        alert(`
            ${new Date().getFullYear() - userYearOfBirth} років
            Ти живеш у місті ${userCity}
            Ваш улюблений спорт ${userSport}
        `);
    }
}